/* 
 Localizable.strings
 Recent Menu
 
 Created by Tim Schröder on 09.02.11.
 Copyright 2011 Tim Schroeder. All rights reserved.
 */

MENU_RECENTITEMS = "Recent Items";
MENU_RECENTITEMS_EMPTY = "No Recent Items";
MENU_QUIT = "Quit Recent Menu";
MENU_ABOUT = "About Recent Menu";
MENU_PREFERENCES = "Preferences...";
MENU_HELP = "Recent Menu Help";
MENU_SHOWINFINDER = "Show \"%@\" in Finder";
MENU_WAITNOTICE = "Please wait ..";
MENU_SANDBOXNOTICE = "No read access rights";

SCOPE_TITLE_ALL = "Everything";
SCOPE_TITLE_PAGES = "iWork Files";
SCOPE_TITLE_SOURCE = "Source Code";
SCOPE_TITLE_DOCUMENTS = "Documents";
SCOPE_TITLE_PDF = "PDF";
SCOPE_TITLE_MOVIES = "Movies";
SCOPE_TITLE_IMAGES = "Images";
SCOPE_TITLE_FOLDERS = "Folders";
SCOPE_TITLE_APPS = "Apps";


PREFWINDOW_TITLE = "%@ Preferences";
PREFWINDOW_GENERALPANE = "General";
PREFWINDOW_SEARCHPANE = "Search";
PREFWINDOW_QUERIESPANE = "Filter";

PREFWINDOW_STARTUP = "Launch At Login:";
PREFWINDOW_GRANTBUTTON = "Grant Access";
PREFWINDOW_REVOKEBUTTON ="Revoke Access";

PREFWINDOW_SEARCHTIME = "Search Period:";
PREFWINDOW_SEARCHTIMEPREFIX = "The last"; 
PREFWINDOW_SEARCHTIMESUFFIX = "hours";

PREFWINDOW_SEARCHSCOPE = "Search Scope:";
PREFWINDOW_SEARCHSCOPESMALL = "Only user opened files";
PREFWINDOW_SEARCHSCOPEBIG = "All opened or modified files";

PREFWINDOW_SEARCHLOCATION = "Search Location:";
PREFWINDOW_SEARCHLOCATIONSMALL = "Only user and application folders";
PREFWINDOW_SEARCHLOCATIONBIG = "All local folders";

PREFWINDOW_QUERYTITLE = "Title:";
PREFWINDOW_QUERYENABLEDCHECKBOX = "Show In Menu";
PREFWINDOW_QUERYENABLEDTITLE = "Display:";
PREFWINDOW_QUERYCOUNTTITLE = "Items";
PREFWINDOW_QUERYISCAPTION = "Search String:";
PREFWINDOW_QUERYCRITERIONTITLE = "Search for:";
PREFWINDOW_WILDCARD = "Use '*' as wildcard, '\' to separate values\r\n'!' as NOT operator";

PREFWINDOW_RESETCAPTION = "Reset Filters";

PREFWINDOW_ACCESSLABEL = "File System Access:";
PREFWINDOW_NEEDACCESSMESSAGE = "You need to grant Recent Menu read access to your file system. Please click on the Grant Access button to proceed.";
PREFWINDOW_ACCESSERRORCAPTION = "An error ocurred";
PREFWINDOW_ACCESSERRORINFO = "Please refrain from selecting any file or folder in the Grant Access dialog.";

QUERY_DEFAULTTITLE = "Filter";
QUERY_DEFAULTDESCRIPTION = "Description";
